triularity/nibbler/src/gpio/avr/impl_atmega640_1280_1281_2560_2561.c
/*
 * THIS FILE IS AUTO-GENERATED. ANY EDITS MAY BE LOST.
 *
 * Make changes to: atmega640_1280_1281_2560_2561.avrspec
 *
 * Pin configuration for atmega640/atmega1280/atmega1281/atmega2560/atmega2561.
 */
#if	defined(__AVR_ATmega640__) || defined(__AVR_ATmega1280__) || defined(__AVR_ATmega1281__) || defined(__AVR_ATmega2560__) || defined(__AVR_ATmega2561__)

#include <stdint.h>
#include <avr/io.h>
#include <avr/pgmspace.h>

#include "gpio_private.h"


uint8_t			_gpio_adc_reference = 0;

const gpio_timer_t PROGMEM	_gpio_timers[] =
{
	/* timer_0A */
	{
#ifndef	WITHOUT_HIRES_TIMERS
		GPIO_TIMER_TYPE_8BIT,
#endif
		REG_TO_OFFSET(TCCR0A),
		(uint8_t) ~((1<<COM0A1)|(1<<COM0A0)),
		(1<<COM0A1),
		REG_TO_OFFSET(OCR0A)
	},
	/* timer_0B */
	{
#ifndef	WITHOUT_HIRES_TIMERS
		GPIO_TIMER_TYPE_8BIT,
#endif
		REG_TO_OFFSET(TCCR0A),
		(uint8_t) ~((1<<COM0B1)|(1<<COM0B0)),
		(1<<COM0B1),
		REG_TO_OFFSET(OCR0B)
	},
	/* timer_1A */
	{
#ifndef	WITHOUT_HIRES_TIMERS
		GPIO_TIMER_TYPE_16BIT,
#endif
		REG_TO_OFFSET(TCCR1A),
		(uint8_t) ~((1<<COM1A1)|(1<<COM1A0)),
		(1<<COM1A1),
		REG_TO_OFFSET(OCR1A)
	},
	/* timer_1B */
	{
#ifndef	WITHOUT_HIRES_TIMERS
		GPIO_TIMER_TYPE_16BIT,
#endif
		REG_TO_OFFSET(TCCR1A),
		(uint8_t) ~((1<<COM1B1)|(1<<COM1B0)),
		(1<<COM1B1),
		REG_TO_OFFSET(OCR1B)
	},
	/* timer_2A */
	{
#ifndef	WITHOUT_HIRES_TIMERS
		GPIO_TIMER_TYPE_8BIT,
#endif
		REG_TO_OFFSET(TCCR2A),
		(uint8_t) ~((1<<COM2A1)|(1<<COM2A0)),
		(1<<COM2A1),
		REG_TO_OFFSET(OCR2A)
	},
	/* timer_2B */
	{
#ifndef	WITHOUT_HIRES_TIMERS
		GPIO_TIMER_TYPE_8BIT,
#endif
		REG_TO_OFFSET(TCCR2A),
		(uint8_t) ~((1<<COM2B1)|(1<<COM2B0)),
		(1<<COM2B1),
		REG_TO_OFFSET(OCR2B)
	},
	/* timer_3A */
	{
#ifndef	WITHOUT_HIRES_TIMERS
		GPIO_TIMER_TYPE_16BIT,
#endif
		REG_TO_OFFSET(TCCR3A),
		(uint8_t) ~((1<<COM3A1)|(1<<COM3A0)),
		(1<<COM3A1),
		REG_TO_OFFSET(OCR3A)
	},
	/* timer_3B */
	{
#ifndef	WITHOUT_HIRES_TIMERS
		GPIO_TIMER_TYPE_16BIT,
#endif
		REG_TO_OFFSET(TCCR3A),
		(uint8_t) ~((1<<COM3B1)|(1<<COM3B0)),
		(1<<COM3B1),
		REG_TO_OFFSET(OCR3B)
	},
	/* timer_3C */
	{
#ifndef	WITHOUT_HIRES_TIMERS
		GPIO_TIMER_TYPE_16BIT,
#endif
		REG_TO_OFFSET(TCCR3A),
		(uint8_t) ~((1<<COM3C1)|(1<<COM3C0)),
		(1<<COM3C1),
		REG_TO_OFFSET(OCR3C)
	},
	/* timer_4A */
	{
#ifndef	WITHOUT_HIRES_TIMERS
		GPIO_TIMER_TYPE_16BIT,
#endif
		REG_TO_OFFSET(TCCR4A),
		(uint8_t) ~((1<<COM4A1)|(1<<COM4A0)),
		(1<<COM4A1),
		REG_TO_OFFSET(OCR4A)
	},
	/* timer_4B */
	{
#ifndef	WITHOUT_HIRES_TIMERS
		GPIO_TIMER_TYPE_16BIT,
#endif
		REG_TO_OFFSET(TCCR4A),
		(uint8_t) ~((1<<COM4B1)|(1<<COM4B0)),
		(1<<COM4B1),
		REG_TO_OFFSET(OCR4B)
	},
	/* timer_4C */
	{
#ifndef	WITHOUT_HIRES_TIMERS
		GPIO_TIMER_TYPE_16BIT,
#endif
		REG_TO_OFFSET(TCCR4A),
		(uint8_t) ~((1<<COM4C1)|(1<<COM4C0)),
		(1<<COM4C1),
		REG_TO_OFFSET(OCR4C)
	},
	/* timer_5A */
	{
#ifndef	WITHOUT_HIRES_TIMERS
		GPIO_TIMER_TYPE_16BIT,
#endif
		REG_TO_OFFSET(TCCR5A),
		(uint8_t) ~((1<<COM5A1)|(1<<COM5A0)),
		(1<<COM5A1),
		REG_TO_OFFSET(OCR5A)
	},
	/* timer_5B */
	{
#ifndef	WITHOUT_HIRES_TIMERS
		GPIO_TIMER_TYPE_16BIT,
#endif
		REG_TO_OFFSET(TCCR5A),
		(uint8_t) ~((1<<COM5B1)|(1<<COM5B0)),
		(1<<COM5B1),
		REG_TO_OFFSET(OCR5B)
	},
	/* timer_5C */
	{
#ifndef	WITHOUT_HIRES_TIMERS
		GPIO_TIMER_TYPE_16BIT,
#endif
		REG_TO_OFFSET(TCCR5A),
		(uint8_t) ~((1<<COM5C1)|(1<<COM5C0)),
		(1<<COM5C1),
		REG_TO_OFFSET(OCR5C)
	}
};


const struct _gpio_pin PROGMEM	_gpio_pins[GPIO_PIN_COUNT] =
{
	/* #0 - D0 (PE0/PCINT8) */
	{
		REG_TO_OFFSET(DDRE),
		REG_TO_OFFSET(PORTE),
		REG_TO_OFFSET(PINE),
		(1 << 0), /* DDRE0/PORTE0/PINE0 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
	},

	/* #1 - D1 (PE1) */
	{
		REG_TO_OFFSET(DDRE),
		REG_TO_OFFSET(PORTE),
		REG_TO_OFFSET(PINE),
		(1 << 1), /* DDRE1/PORTE1/PINE1 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
	},

	/* #2 - D2 (PE4/OC3B) */
	{
		REG_TO_OFFSET(DDRE),
		REG_TO_OFFSET(PORTE),
		REG_TO_OFFSET(PINE),
		(1 << 4), /* DDRE4/PORTE4/PINE4 */
		GPIO_NO_ADC,
#ifndef	WITHOUT_HIRES_TIMERS
		7 /* timer_3B */
#else
		GPIO_NO_TIMER
#endif
	},

	/* #3 - D3 (PE5/OC3C) */
	{
		REG_TO_OFFSET(DDRE),
		REG_TO_OFFSET(PORTE),
		REG_TO_OFFSET(PINE),
		(1 << 5), /* DDRE5/PORTE5/PINE5 */
		GPIO_NO_ADC,
#ifndef	WITHOUT_HIRES_TIMERS
		8 /* timer_3C */
#else
		GPIO_NO_TIMER
#endif
	},

	/* #4 - D4 (PG5/OC0B) */
	{
		REG_TO_OFFSET(DDRG),
		REG_TO_OFFSET(PORTG),
		REG_TO_OFFSET(PING),
		(1 << 5), /* DDRG5/PORTG5/PING5 */
		GPIO_NO_ADC,
		1 /* timer_0B */
	},

	/* #5 - D5 (PE3/OC3A) */
	{
		REG_TO_OFFSET(DDRE),
		REG_TO_OFFSET(PORTE),
		REG_TO_OFFSET(PINE),
		(1 << 3), /* DDRE3/PORTE3/PINE3 */
		GPIO_NO_ADC,
#ifndef	WITHOUT_HIRES_TIMERS
		6 /* timer_3A */
#else
		GPIO_NO_TIMER
#endif
	},

	/* #6 - D6 (PH3/OC4A) */
	{
#if	!defined(__AVR_ATmega1281__) && !defined(__AVR_ATmega2561__)
		REG_TO_OFFSET(DDRH),
		REG_TO_OFFSET(PORTH),
		REG_TO_OFFSET(PINH),
		(1 << 3), /* DDRH3/PORTH3/PINH3 */
		GPIO_NO_ADC,
#ifndef	WITHOUT_HIRES_TIMERS
		9 /* timer_4A */
#else
		GPIO_NO_TIMER
#endif
#else	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		0,
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#endif	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
	},

	/* #7 - D7 (PH4/OC4B) */
	{
#if	!defined(__AVR_ATmega1281__) && !defined(__AVR_ATmega2561__)
		REG_TO_OFFSET(DDRH),
		REG_TO_OFFSET(PORTH),
		REG_TO_OFFSET(PINH),
		(1 << 4), /* DDRH4/PORTH4/PINH4 */
		GPIO_NO_ADC,
#ifndef	WITHOUT_HIRES_TIMERS
		10 /* timer_4B */
#else
		GPIO_NO_TIMER
#endif
#else	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		0,
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#endif	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
	},

	/* #8 - D8 (PH5/OC4C) */
	{
#if	!defined(__AVR_ATmega1281__) && !defined(__AVR_ATmega2561__)
		REG_TO_OFFSET(DDRH),
		REG_TO_OFFSET(PORTH),
		REG_TO_OFFSET(PINH),
		(1 << 5), /* DDRH5/PORTH5/PINH5 */
		GPIO_NO_ADC,
#ifndef	WITHOUT_HIRES_TIMERS
		11 /* timer_4C */
#else
		GPIO_NO_TIMER
#endif
#else	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		0,
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#endif	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
	},

