triularity/nibbler/src/gpio/avr/impl_atmega640_1280_1281_2560_2561.c
	/* #9 - D9 (PH6/OC2B) */
	{
#if	!defined(__AVR_ATmega1281__) && !defined(__AVR_ATmega2561__)
		REG_TO_OFFSET(DDRH),
		REG_TO_OFFSET(PORTH),
		REG_TO_OFFSET(PINH),
		(1 << 6), /* DDRH6/PORTH6/PINH6 */
		GPIO_NO_ADC,
		5 /* timer_2B */
#else	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		0,
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#endif	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
	},

	/* #10 - D10 (PB4/OC2A/PCINT4) */
	{
		REG_TO_OFFSET(DDRB),
		REG_TO_OFFSET(PORTB),
		REG_TO_OFFSET(PINB),
		(1 << 4), /* DDRB4/PORTB4/PINB4 */
		GPIO_NO_ADC,
		4 /* timer_2A */
	},

	/* #11 - D11 (PB5/OC1A/PCINT5) */
	{
		REG_TO_OFFSET(DDRB),
		REG_TO_OFFSET(PORTB),
		REG_TO_OFFSET(PINB),
		(1 << 5), /* DDRB5/PORTB5/PINB5 */
		GPIO_NO_ADC,
#ifndef	WITHOUT_HIRES_TIMERS
		2 /* timer_1A */
#else
		GPIO_NO_TIMER
#endif
	},

	/* #12 - D12 (PB6/OC1B/PCINT6) */
	{
		REG_TO_OFFSET(DDRB),
		REG_TO_OFFSET(PORTB),
		REG_TO_OFFSET(PINB),
		(1 << 6), /* DDRB6/PORTB6/PINB6 */
		GPIO_NO_ADC,
#ifndef	WITHOUT_HIRES_TIMERS
		3 /* timer_1B */
#else
		GPIO_NO_TIMER
#endif
	},

	/* #13 - D13 (PB7/OC0A/PCINT7) */
	{
		REG_TO_OFFSET(DDRB),
		REG_TO_OFFSET(PORTB),
		REG_TO_OFFSET(PINB),
		(1 << 7), /* DDRB7/PORTB7/PINB7 */
		GPIO_NO_ADC,
		0 /* timer_0A */
	},

	/* #14 - D14 (PJ1/PCINT10) */
	{
#if	!defined(__AVR_ATmega1281__) && !defined(__AVR_ATmega2561__)
		REG_TO_OFFSET(DDRJ),
		REG_TO_OFFSET(PORTJ),
		REG_TO_OFFSET(PINJ),
		(1 << 1), /* DDRJ1/PORTJ1/PINJ1 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#else	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		0,
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#endif	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
	},

	/* #15 - D15 (PJ0/PCINT9) */
	{
#if	!defined(__AVR_ATmega1281__) && !defined(__AVR_ATmega2561__)
		REG_TO_OFFSET(DDRJ),
		REG_TO_OFFSET(PORTJ),
		REG_TO_OFFSET(PINJ),
		(1 << 0), /* DDRJ0/PORTJ0/PINJ0 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#else	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		0,
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#endif	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
	},

	/* #16 - D16 (PH1) */
	{
#if	!defined(__AVR_ATmega1281__) && !defined(__AVR_ATmega2561__)
		REG_TO_OFFSET(DDRH),
		REG_TO_OFFSET(PORTH),
		REG_TO_OFFSET(PINH),
		(1 << 1), /* DDRH1/PORTH1/PINH1 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#else	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		0,
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#endif	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
	},

	/* #17 - D17 (PH0) */
	{
#if	!defined(__AVR_ATmega1281__) && !defined(__AVR_ATmega2561__)
		REG_TO_OFFSET(DDRH),
		REG_TO_OFFSET(PORTH),
		REG_TO_OFFSET(PINH),
		(1 << 0), /* DDRH0/PORTH0/PINH0 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#else	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		0,
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#endif	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
	},

	/* #18 - D18 (PD3) */
	{
		REG_TO_OFFSET(DDRD),
		REG_TO_OFFSET(PORTD),
		REG_TO_OFFSET(PIND),
		(1 << 3), /* DDRD3/PORTD3/PIND3 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
	},

	/* #19 - D19 (PD2) */
	{
		REG_TO_OFFSET(DDRD),
		REG_TO_OFFSET(PORTD),
		REG_TO_OFFSET(PIND),
		(1 << 2), /* DDRD2/PORTD2/PIND2 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
	},

	/* #20 - D20 (PD1) */
	{
		REG_TO_OFFSET(DDRD),
		REG_TO_OFFSET(PORTD),
		REG_TO_OFFSET(PIND),
		(1 << 1), /* DDRD1/PORTD1/PIND1 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
	},

	/* #21 - D21 (PD0) */
	{
		REG_TO_OFFSET(DDRD),
		REG_TO_OFFSET(PORTD),
		REG_TO_OFFSET(PIND),
		(1 << 0), /* DDRD0/PORTD0/PIND0 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
	},

	/* #22 - D22 (PA0) */
	{
		REG_TO_OFFSET(DDRA),
		REG_TO_OFFSET(PORTA),
		REG_TO_OFFSET(PINA),
		(1 << 0), /* DDRA0/PORTA0/PINA0 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
	},

	/* #23 - D23 (PA1) */
	{
		REG_TO_OFFSET(DDRA),
		REG_TO_OFFSET(PORTA),
		REG_TO_OFFSET(PINA),
		(1 << 1), /* DDRA1/PORTA1/PINA1 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
	},

	/* #24 - D24 (PA2) */
	{
		REG_TO_OFFSET(DDRA),
		REG_TO_OFFSET(PORTA),
		REG_TO_OFFSET(PINA),
		(1 << 2), /* DDRA2/PORTA2/PINA2 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
	},

	/* #25 - D25 (PA3) */
	{
		REG_TO_OFFSET(DDRA),
		REG_TO_OFFSET(PORTA),
		REG_TO_OFFSET(PINA),
		(1 << 3), /* DDRA3/PORTA3/PINA3 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
	},

	/* #26 - D26 (PA4) */
	{
		REG_TO_OFFSET(DDRA),
		REG_TO_OFFSET(PORTA),
		REG_TO_OFFSET(PINA),
		(1 << 4), /* DDRA4/PORTA4/PINA4 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
	},

	/* #27 - D27 (PA5) */
	{
		REG_TO_OFFSET(DDRA),
		REG_TO_OFFSET(PORTA),
		REG_TO_OFFSET(PINA),
		(1 << 5), /* DDRA5/PORTA5/PINA5 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
	},

	/* #28 - D28 (PA6) */
	{
		REG_TO_OFFSET(DDRA),
		REG_TO_OFFSET(PORTA),
		REG_TO_OFFSET(PINA),
		(1 << 6), /* DDRA6/PORTA6/PINA6 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
	},

	/* #29 - D29 (PA7) */
	{
		REG_TO_OFFSET(DDRA),
		REG_TO_OFFSET(PORTA),
		REG_TO_OFFSET(PINA),
		(1 << 7), /* DDRA7/PORTA7/PINA7 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
	},

	/* #30 - D30 (PC7) */
	{
		REG_TO_OFFSET(DDRC),
		REG_TO_OFFSET(PORTC),
		REG_TO_OFFSET(PINC),
		(1 << 7), /* DDRC7/PORTC7/PINC7 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
	},

	/* #31 - D31 (PC6) */
	{
		REG_TO_OFFSET(DDRC),
		REG_TO_OFFSET(PORTC),
		REG_TO_OFFSET(PINC),
		(1 << 6), /* DDRC6/PORTC6/PINC6 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
	},

	/* #32 - D32 (PC5) */
	{
		REG_TO_OFFSET(DDRC),
		REG_TO_OFFSET(PORTC),
		REG_TO_OFFSET(PINC),
		(1 << 5), /* DDRC5/PORTC5/PINC5 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
	},

	/* #33 - D33 (PC4) */
	{
		REG_TO_OFFSET(DDRC),
		REG_TO_OFFSET(PORTC),
		REG_TO_OFFSET(PINC),
		(1 << 4), /* DDRC4/PORTC4/PINC4 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
	},

	/* #34 - D34 (PC3) */
	{
		REG_TO_OFFSET(DDRC),
		REG_TO_OFFSET(PORTC),
		REG_TO_OFFSET(PINC),
		(1 << 3), /* DDRC3/PORTC3/PINC3 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
	},

	/* #35 - D35 (PC2) */
	{
		REG_TO_OFFSET(DDRC),
		REG_TO_OFFSET(PORTC),
		REG_TO_OFFSET(PINC),
		(1 << 2), /* DDRC2/PORTC2/PINC2 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
	},

	/* #36 - D36 (PC1) */
	{
		REG_TO_OFFSET(DDRC),
		REG_TO_OFFSET(PORTC),
		REG_TO_OFFSET(PINC),
		(1 << 1), /* DDRC1/PORTC1/PINC1 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
	},

	/* #37 - D37 (PC0) */
	{
		REG_TO_OFFSET(DDRC),
		REG_TO_OFFSET(PORTC),
		REG_TO_OFFSET(PINC),
		(1 << 0), /* DDRC0/PORTC0/PINC0 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
	},

	/* #38 - D38 (PD7) */
	{
		REG_TO_OFFSET(DDRD),
		REG_TO_OFFSET(PORTD),
		REG_TO_OFFSET(PIND),
		(1 << 7), /* DDRD7/PORTD7/PIND7 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
	},

