triularity/nibbler/src/gpio/avr/impl_atmega640_1280_1281_2560_2561.c
	/* #39 - D39 (PG2) */
	{
		REG_TO_OFFSET(DDRG),
		REG_TO_OFFSET(PORTG),
		REG_TO_OFFSET(PING),
		(1 << 2), /* DDRG2/PORTG2/PING2 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
	},

	/* #40 - D40 (PG1) */
	{
		REG_TO_OFFSET(DDRG),
		REG_TO_OFFSET(PORTG),
		REG_TO_OFFSET(PING),
		(1 << 1), /* DDRG1/PORTG1/PING1 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
	},

	/* #41 - D41 (PG0) */
	{
		REG_TO_OFFSET(DDRG),
		REG_TO_OFFSET(PORTG),
		REG_TO_OFFSET(PING),
		(1 << 0), /* DDRG0/PORTG0/PING0 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
	},

	/* #42 - D42 (PL7) */
	{
#if	!defined(__AVR_ATmega1281__) && !defined(__AVR_ATmega2561__)
		REG_TO_OFFSET(DDRL),
		REG_TO_OFFSET(PORTL),
		REG_TO_OFFSET(PINL),
		(1 << 7), /* DDRL7/PORTL7/PINL7 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#else	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		0,
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#endif	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
	},

	/* #43 - D43 (PL6) */
	{
#if	!defined(__AVR_ATmega1281__) && !defined(__AVR_ATmega2561__)
		REG_TO_OFFSET(DDRL),
		REG_TO_OFFSET(PORTL),
		REG_TO_OFFSET(PINL),
		(1 << 6), /* DDRL6/PORTL6/PINL6 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#else	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		0,
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#endif	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
	},

	/* #44 - D44 (PL5/OC5C) */
	{
#if	!defined(__AVR_ATmega1281__) && !defined(__AVR_ATmega2561__)
		REG_TO_OFFSET(DDRL),
		REG_TO_OFFSET(PORTL),
		REG_TO_OFFSET(PINL),
		(1 << 5), /* DDRL5/PORTL5/PINL5 */
		GPIO_NO_ADC,
#ifndef	WITHOUT_HIRES_TIMERS
		14 /* timer_5C */
#else
		GPIO_NO_TIMER
#endif
#else	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		0,
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#endif	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
	},

	/* #45 - D45 (PL4/OC5B) */
	{
#if	!defined(__AVR_ATmega1281__) && !defined(__AVR_ATmega2561__)
		REG_TO_OFFSET(DDRL),
		REG_TO_OFFSET(PORTL),
		REG_TO_OFFSET(PINL),
		(1 << 4), /* DDRL4/PORTL4/PINL4 */
		GPIO_NO_ADC,
#ifndef	WITHOUT_HIRES_TIMERS
		13 /* timer_5B */
#else
		GPIO_NO_TIMER
#endif
#else	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		0,
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#endif	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
	},

	/* #46 - D46 (PL3/OC5A) */
	{
#if	!defined(__AVR_ATmega1281__) && !defined(__AVR_ATmega2561__)
		REG_TO_OFFSET(DDRL),
		REG_TO_OFFSET(PORTL),
		REG_TO_OFFSET(PINL),
		(1 << 3), /* DDRL3/PORTL3/PINL3 */
		GPIO_NO_ADC,
#ifndef	WITHOUT_HIRES_TIMERS
		12 /* timer_5A */
#else
		GPIO_NO_TIMER
#endif
#else	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		0,
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#endif	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
	},

	/* #47 - D47 (PL2) */
	{
#if	!defined(__AVR_ATmega1281__) && !defined(__AVR_ATmega2561__)
		REG_TO_OFFSET(DDRL),
		REG_TO_OFFSET(PORTL),
		REG_TO_OFFSET(PINL),
		(1 << 2), /* DDRL2/PORTL2/PINL2 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#else	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		0,
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#endif	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
	},

	/* #48 - D48 (PL1) */
	{
#if	!defined(__AVR_ATmega1281__) && !defined(__AVR_ATmega2561__)
		REG_TO_OFFSET(DDRL),
		REG_TO_OFFSET(PORTL),
		REG_TO_OFFSET(PINL),
		(1 << 1), /* DDRL1/PORTL1/PINL1 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#else	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		0,
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#endif	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
	},

	/* #49 - D49 (PL0) */
	{
#if	!defined(__AVR_ATmega1281__) && !defined(__AVR_ATmega2561__)
		REG_TO_OFFSET(DDRL),
		REG_TO_OFFSET(PORTL),
		REG_TO_OFFSET(PINL),
		(1 << 0), /* DDRL0/PORTL0/PINL0 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#else	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		0,
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#endif	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
	},

	/* #50 - D50 (PB3/PCINT3) */
	{
		REG_TO_OFFSET(DDRB),
		REG_TO_OFFSET(PORTB),
		REG_TO_OFFSET(PINB),
		(1 << 3), /* DDRB3/PORTB3/PINB3 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
	},

	/* #51 - D51 (PB2/PCINT2) */
	{
		REG_TO_OFFSET(DDRB),
		REG_TO_OFFSET(PORTB),
		REG_TO_OFFSET(PINB),
		(1 << 2), /* DDRB2/PORTB2/PINB2 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
	},

	/* #52 - D52 (PB1/PCINT1) */
	{
		REG_TO_OFFSET(DDRB),
		REG_TO_OFFSET(PORTB),
		REG_TO_OFFSET(PINB),
		(1 << 1), /* DDRB1/PORTB1/PINB1 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
	},

	/* #53 - D53 (PB0/PCINT0) */
	{
		REG_TO_OFFSET(DDRB),
		REG_TO_OFFSET(PORTB),
		REG_TO_OFFSET(PINB),
		(1 << 0), /* DDRB0/PORTB0/PINB0 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
	},

	/* #54 - D54/A0 (PF0/ADC0) */
	{
		REG_TO_OFFSET(DDRF),
		REG_TO_OFFSET(PORTF),
		REG_TO_OFFSET(PINF),
		(1 << 0), /* DDRF0/PORTF0/PINF0 */
		0,
		GPIO_NO_TIMER
	},

	/* #55 - D55/A1 (PF1/ADC1) */
	{
		REG_TO_OFFSET(DDRF),
		REG_TO_OFFSET(PORTF),
		REG_TO_OFFSET(PINF),
		(1 << 1), /* DDRF1/PORTF1/PINF1 */
		1,
		GPIO_NO_TIMER
	},

	/* #56 - D56/A2 (PF2/ADC2) */
	{
		REG_TO_OFFSET(DDRF),
		REG_TO_OFFSET(PORTF),
		REG_TO_OFFSET(PINF),
		(1 << 2), /* DDRF2/PORTF2/PINF2 */
		2,
		GPIO_NO_TIMER
	},

	/* #57 - D57/A3 (PF3/ADC3) */
	{
		REG_TO_OFFSET(DDRF),
		REG_TO_OFFSET(PORTF),
		REG_TO_OFFSET(PINF),
		(1 << 3), /* DDRF3/PORTF3/PINF3 */
		3,
		GPIO_NO_TIMER
	},

	/* #58 - D58/A4 (PF4/ADC4) */
	{
		REG_TO_OFFSET(DDRF),
		REG_TO_OFFSET(PORTF),
		REG_TO_OFFSET(PINF),
		(1 << 4), /* DDRF4/PORTF4/PINF4 */
		4,
		GPIO_NO_TIMER
	},

	/* #59 - D59/A5 (PF5/ADC5) */
	{
		REG_TO_OFFSET(DDRF),
		REG_TO_OFFSET(PORTF),
		REG_TO_OFFSET(PINF),
		(1 << 5), /* DDRF5/PORTF5/PINF5 */
		5,
		GPIO_NO_TIMER
	},

	/* #60 - D60/A6 (PF6/ADC6) */
	{
		REG_TO_OFFSET(DDRF),
		REG_TO_OFFSET(PORTF),
		REG_TO_OFFSET(PINF),
		(1 << 6), /* DDRF6/PORTF6/PINF6 */
		6,
		GPIO_NO_TIMER
	},

	/* #61 - D61/A7 (PF7/ADC7) */
	{
		REG_TO_OFFSET(DDRF),
		REG_TO_OFFSET(PORTF),
		REG_TO_OFFSET(PINF),
		(1 << 7), /* DDRF7/PORTF7/PINF7 */
		7,
		GPIO_NO_TIMER
	},

	/* #62 - D62/A8 (PK0/ADC8/PCINT16) */
	{
#if	!defined(__AVR_ATmega1281__) && !defined(__AVR_ATmega2561__)
		REG_TO_OFFSET(DDRK),
		REG_TO_OFFSET(PORTK),
		REG_TO_OFFSET(PINK),
		(1 << 0), /* DDRK0/PORTK0/PINK0 */
		32,
		GPIO_NO_TIMER
#else	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		0,
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#endif	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
	},

	/* #63 - D63/A9 (PK1/ADC9/PCINT17) */
	{
#if	!defined(__AVR_ATmega1281__) && !defined(__AVR_ATmega2561__)
		REG_TO_OFFSET(DDRK),
		REG_TO_OFFSET(PORTK),
		REG_TO_OFFSET(PINK),
		(1 << 1), /* DDRK1/PORTK1/PINK1 */
		33,
		GPIO_NO_TIMER
#else	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		0,
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#endif	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
	},

	/* #64 - D64/A10 (PK2/ADC10/PCINT18) */
	{
#if	!defined(__AVR_ATmega1281__) && !defined(__AVR_ATmega2561__)
		REG_TO_OFFSET(DDRK),
		REG_TO_OFFSET(PORTK),
		REG_TO_OFFSET(PINK),
		(1 << 2), /* DDRK2/PORTK2/PINK2 */
		34,
		GPIO_NO_TIMER
#else	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		0,
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#endif	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
	},

