triularity/nibbler/src/gpio/avr/impl_atmega640_1280_1281_2560_2561.c
	/* #65 - D65/A11 (PK3/ADC11/PCINT19) */
	{
#if	!defined(__AVR_ATmega1281__) && !defined(__AVR_ATmega2561__)
		REG_TO_OFFSET(DDRK),
		REG_TO_OFFSET(PORTK),
		REG_TO_OFFSET(PINK),
		(1 << 3), /* DDRK3/PORTK3/PINK3 */
		35,
		GPIO_NO_TIMER
#else	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		0,
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#endif	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
	},

	/* #66 - D66/A12 (PK4/ADC12/PCINT20) */
	{
#if	!defined(__AVR_ATmega1281__) && !defined(__AVR_ATmega2561__)
		REG_TO_OFFSET(DDRK),
		REG_TO_OFFSET(PORTK),
		REG_TO_OFFSET(PINK),
		(1 << 4), /* DDRK4/PORTK4/PINK4 */
		36,
		GPIO_NO_TIMER
#else	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		0,
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#endif	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
	},

	/* #67 - D67/A13 (PK5/ADC13/PCINT21) */
	{
#if	!defined(__AVR_ATmega1281__) && !defined(__AVR_ATmega2561__)
		REG_TO_OFFSET(DDRK),
		REG_TO_OFFSET(PORTK),
		REG_TO_OFFSET(PINK),
		(1 << 5), /* DDRK5/PORTK5/PINK5 */
		37,
		GPIO_NO_TIMER
#else	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		0,
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#endif	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
	},

	/* #68 - D68/A14 (PK6/ADC14/PCINT22) */
	{
#if	!defined(__AVR_ATmega1281__) && !defined(__AVR_ATmega2561__)
		REG_TO_OFFSET(DDRK),
		REG_TO_OFFSET(PORTK),
		REG_TO_OFFSET(PINK),
		(1 << 6), /* DDRK6/PORTK6/PINK6 */
		38,
		GPIO_NO_TIMER
#else	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		0,
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#endif	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
	},

	/* #69 - D69/A15 (PK7/ADC15/PCINT23) */
	{
#if	!defined(__AVR_ATmega1281__) && !defined(__AVR_ATmega2561__)
		REG_TO_OFFSET(DDRK),
		REG_TO_OFFSET(PORTK),
		REG_TO_OFFSET(PINK),
		(1 << 7), /* DDRK7/PORTK7/PINK7 */
		39,
		GPIO_NO_TIMER
#else	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		0,
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#endif	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
	},

	/* #70 - D70 (PD4) */
	{
		REG_TO_OFFSET(DDRD),
		REG_TO_OFFSET(PORTD),
		REG_TO_OFFSET(PIND),
		(1 << 4), /* DDRD4/PORTD4/PIND4 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
	},

	/* #71 - D71 (PD5) */
	{
		REG_TO_OFFSET(DDRD),
		REG_TO_OFFSET(PORTD),
		REG_TO_OFFSET(PIND),
		(1 << 5), /* DDRD5/PORTD5/PIND5 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
	},

	/* #72 - D72 (PD6) */
	{
		REG_TO_OFFSET(DDRD),
		REG_TO_OFFSET(PORTD),
		REG_TO_OFFSET(PIND),
		(1 << 6), /* DDRD6/PORTD6/PIND6 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
	},

	/* #73 - D73 (PE2) */
	{
		REG_TO_OFFSET(DDRE),
		REG_TO_OFFSET(PORTE),
		REG_TO_OFFSET(PINE),
		(1 << 2), /* DDRE2/PORTE2/PINE2 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
	},

	/* #74 - D74 (PE6) */
	{
		REG_TO_OFFSET(DDRE),
		REG_TO_OFFSET(PORTE),
		REG_TO_OFFSET(PINE),
		(1 << 6), /* DDRE6/PORTE6/PINE6 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
	},

	/* #75 - D75 (PE7) */
	{
		REG_TO_OFFSET(DDRE),
		REG_TO_OFFSET(PORTE),
		REG_TO_OFFSET(PINE),
		(1 << 7), /* DDRE7/PORTE7/PINE7 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
	},

	/* #76 - D76 (PH2) */
	{
#if	!defined(__AVR_ATmega1281__) && !defined(__AVR_ATmega2561__)
		REG_TO_OFFSET(DDRH),
		REG_TO_OFFSET(PORTH),
		REG_TO_OFFSET(PINH),
		(1 << 2), /* DDRH2/PORTH2/PINH2 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#else	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		0,
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#endif	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
	},

	/* #77 - D77 (PH7) */
	{
#if	!defined(__AVR_ATmega1281__) && !defined(__AVR_ATmega2561__)
		REG_TO_OFFSET(DDRH),
		REG_TO_OFFSET(PORTH),
		REG_TO_OFFSET(PINH),
		(1 << 7), /* DDRH7/PORTH7/PINH7 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#else	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		0,
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#endif	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
	},

	/* #78 - D78 (PJ2/PCINT11) */
	{
#if	!defined(__AVR_ATmega1281__) && !defined(__AVR_ATmega2561__)
		REG_TO_OFFSET(DDRJ),
		REG_TO_OFFSET(PORTJ),
		REG_TO_OFFSET(PINJ),
		(1 << 2), /* DDRJ2/PORTJ2/PINJ2 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#else	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		0,
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#endif	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
	},

	/* #79 - D79 (PJ3/PCINT12) */
	{
#if	!defined(__AVR_ATmega1281__) && !defined(__AVR_ATmega2561__)
		REG_TO_OFFSET(DDRJ),
		REG_TO_OFFSET(PORTJ),
		REG_TO_OFFSET(PINJ),
		(1 << 3), /* DDRJ3/PORTJ3/PINJ3 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#else	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		0,
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#endif	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
	},

	/* #80 - D80 (PJ4/PCINT13) */
	{
#if	!defined(__AVR_ATmega1281__) && !defined(__AVR_ATmega2561__)
		REG_TO_OFFSET(DDRJ),
		REG_TO_OFFSET(PORTJ),
		REG_TO_OFFSET(PINJ),
		(1 << 4), /* DDRJ4/PORTJ4/PINJ4 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#else	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		0,
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#endif	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
	},

	/* #81 - D81 (PJ5/PCINT14) */
	{
#if	!defined(__AVR_ATmega1281__) && !defined(__AVR_ATmega2561__)
		REG_TO_OFFSET(DDRJ),
		REG_TO_OFFSET(PORTJ),
		REG_TO_OFFSET(PINJ),
		(1 << 5), /* DDRJ5/PORTJ5/PINJ5 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#else	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		0,
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#endif	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
	},

	/* #82 - D82 (PJ6/PCINT15) */
	{
#if	!defined(__AVR_ATmega1281__) && !defined(__AVR_ATmega2561__)
		REG_TO_OFFSET(DDRJ),
		REG_TO_OFFSET(PORTJ),
		REG_TO_OFFSET(PINJ),
		(1 << 6), /* DDRJ6/PORTJ6/PINJ6 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#else	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		0,
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#endif	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
	},

	/* #83 - D83 (PJ7) */
	{
#if	!defined(__AVR_ATmega1281__) && !defined(__AVR_ATmega2561__)
		REG_TO_OFFSET(DDRJ),
		REG_TO_OFFSET(PORTJ),
		REG_TO_OFFSET(PINJ),
		(1 << 7), /* DDRJ7/PORTJ7/PINJ7 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#else	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		0,
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#endif	/* !__AVR_ATmega1281__ && !__AVR_ATmega2561__ */
	},

	/* #84 - D84 (PG3/TOSC2) */
	{
#if	defined(WITHOUT_CRYSTAL_OSCILLATOR)
		REG_TO_OFFSET(DDRG),
		REG_TO_OFFSET(PORTG),
		REG_TO_OFFSET(PING),
		(1 << 3), /* DDRG3/PORTG3/PING3 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#else	/* WITHOUT_CRYSTAL_OSCILLATOR */
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		0,
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#endif	/* WITHOUT_CRYSTAL_OSCILLATOR */
	},

	/* #85 - D85 (PG4/TOSC1) */
	{
#if	defined(WITHOUT_CRYSTAL_OSCILLATOR)
		REG_TO_OFFSET(DDRG),
		REG_TO_OFFSET(PORTG),
		REG_TO_OFFSET(PING),
		(1 << 4), /* DDRG4/PORTG4/PING4 */
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#else	/* WITHOUT_CRYSTAL_OSCILLATOR */
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		GPIO_NO_REGISTER,
		0,
		GPIO_NO_ADC,
		GPIO_NO_TIMER
#endif	/* WITHOUT_CRYSTAL_OSCILLATOR */
	}
};


const uint8_t PROGMEM		_gpio_analog_to_digital_pins[GPIO_ANALOG_PIN_COUNT] =
{
	54,	/* A0 -> D54 */
	55,	/* A1 -> D55 */
	56,	/* A2 -> D56 */
	57,	/* A3 -> D57 */
	58,	/* A4 -> D58 */
	59,	/* A5 -> D59 */
	60,	/* A6 -> D60 */
	61,	/* A7 -> D61 */
	62,	/* A8 -> D62 */
	63,	/* A9 -> D63 */
	64,	/* A10 -> D64 */
	65,	/* A11 -> D65 */
	66,	/* A12 -> D66 */
	67,	/* A13 -> D67 */
	68,	/* A14 -> D68 */
	69	/* A15 -> D69 */
};

#endif	/* __AVR_ATmega640__ || __AVR_ATmega1280__ || __AVR_ATmega1281__ || __AVR_ATmega2560__ || __AVR_ATmega2561__ */
